In [48]:
import pandas as pd

In [49]:
# Create some sample data as a dictionary
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily','Mop','Mop'],
    'Age': [25, 30, 35, 40, 28,22,22],
    'City': ['New York', 'London', 'Paris', 'Tokyo', 'London','Sajek','Sajek'],
    'Salary': [70000, 85000, 90000, 110000, 75000,60000,60000]
}

# Create a DataFrame from the dictionary
df = pd.DataFrame(data)

In [50]:
df.head()

      Name  Age      City  Salary
0    Alice   25  New York   70000
1      Bob   30    London   85000
2  Charlie   35     Paris   90000
3    David   40     Tokyo  110000
4    Emily   28    London   75000

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      int64
 2   City    7 non-null      object
 3   Salary  7 non-null      int64
dtypes: int64(2), object(2)
memory usage: 356.0+ bytes

In [52]:
df.describe()

             Age         Salary
count   7.000000       7.000000
mean   28.857143   78571.428571
std     6.743604   17961.599250
min    22.000000   60000.000000
25%    23.500000   65000.000000
50%    28.000000   75000.000000
75%    32.500000   87500.000000
max    40.000000  110000.000000

In [53]:
df['Name']

0      Alice
1        Bob
2    Charlie
3      David
4      Emily
5        Mop
6        Mop
Name: Name, dtype: object

In [54]:
df[['Name','City']]

      Name      City
0    Alice  New York
1      Bob    London
2  Charlie     Paris
3    David     Tokyo
4    Emily    London
5      Mop     Sajek
6      Mop     Sajek

In [55]:
df[df['Age'] > 30]

      Name  Age   City  Salary
2  Charlie   35  Paris   90000
3    David   40  Tokyo  110000

In [56]:
df[df['City'] == 'London']

    Name  Age    City  Salary
1    Bob   30  London   85000
4  Emily   28  London   75000

In [57]:
# Combine conditions (use & for 'and')
# Let's find people in London AND older than 29
df[(df['City'] == 'London') & (df['Age'] > 20)]

    Name  Age    City  Salary
1    Bob   30  London   85000
4  Emily   28  London   75000

In [58]:
# Let's add a new row with a missing age
new_row = {'Name': 'Frank', 'City': 'Chicago', 'Salary': 50000}
df = pd.concat([df, pd.DataFrame([new_row])], ignore_index=True)

# Look at the data now (you'll see 'NaN' for Frank's age)
df.tail()

    Name   Age     City  Salary
3  David  40.0    Tokyo  110000
4  Emily  28.0   London   75000
5    Mop  22.0    Sajek   60000
6    Mop  22.0    Sajek   60000
7  Frank   NaN  Chicago   50000

In [59]:
new_row = {'Name': 'Lori', 'City': 'Chicago', 'Age': 50}
df = pd.concat([df,pd.DataFrame([new_row])], ignore_index=True)
df.tail()

    Name   Age     City   Salary
4  Emily  28.0   London  75000.0
5    Mop  22.0    Sajek  60000.0
6    Mop  22.0    Sajek  60000.0
7  Frank   NaN  Chicago  50000.0
8   Lori  50.0  Chicago      NaN

In [60]:
df_cleaned = df.dropna()
print(df_cleaned)

      Name   Age      City    Salary
0    Alice  25.0  New York   70000.0
1      Bob  30.0    London   85000.0
2  Charlie  35.0     Paris   90000.0
3    David  40.0     Tokyo  110000.0
4    Emily  28.0    London   75000.0
5      Mop  22.0     Sajek   60000.0
6      Mop  22.0     Sajek   60000.0

In [61]:
df_cleaned = df_cleaned.drop_duplicates()

In [62]:
print("new cleaned dataframe:",df_cleaned)

new cleaned dataframe:       Name   Age      City    Salary
0    Alice  25.0  New York   70000.0
1      Bob  30.0    London   85000.0
2  Charlie  35.0     Paris   90000.0
3    David  40.0     Tokyo  110000.0
4    Emily  28.0    London   75000.0
5      Mop  22.0     Sajek   60000.0

In [65]:
average_age = df['Age'].mean()
avarage_salary = df['Salary'].mean()
df_filled = df.fillna({'Age': average_age,'Salary': avarage_salary}) 
print(df_filled)

      Name   Age      City    Salary
0    Alice  25.0  New York   70000.0
1      Bob  30.0    London   85000.0
2  Charlie  35.0     Paris   90000.0
3    David  40.0     Tokyo  110000.0
4    Emily  28.0    London   75000.0
5      Mop  22.0     Sajek   60000.0
6      Mop  22.0     Sajek   60000.0
7    Frank  31.5   Chicago   50000.0
8     Lori  50.0   Chicago   75000.0